Revit 2024 API
PolymeshFacet.IsValidObject Property
 Specifies whether the .NET object represents a valid Revit entity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsValidObject { get; }
Visual Basic
Public ReadOnly Property IsValidObject As Boolean
	Get
Visual C++
public:
property bool IsValidObject {
	bool get ();
}
Return Value
 True if the API object holds a valid Revit native object, false otherwise.
Remarks
 This property is always True for a polymesh facet.
See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace